IDEA Open Model
CheckResPlate Properties
Compatible with IDEA StatiCa 20.1
The CheckResPlate type exposes the following members.
Properties
Name | Description
CheckStatus
 Status of the Check
Items
 In case of presentation of groups plates (uncoiled beams)
LoadCaseId
 Id of Load Case
MaxStrain
 Max Strain
MaxStress
 Max Stress
Name
 Name of Plate
Top
See Also
Reference
CheckResPlate Class
IdeaRS.OpenModel.Connection Namespace